# On souhaite faire matcher pour chaque joueur son id et l'id de sa team (au sens de Skill Corner)

## Importation des bibliothèques

In [1]:
import pandas as pd
import sqlite3

In [2]:
connect = sqlite3.connect("../../Databases/raw-database.db")
cursor = connect.cursor()

## Importation des données

In [9]:
req = cursor.execute(f"SELECT player_id, team_id FROM off_ball_runs")
res = req.fetchall()
desc = req.description
matching_players_teams_SKC = pd.DataFrame(res)
matching_players_teams_SKC.columns = [i[0] for i in desc]

## Traitement des données

In [10]:
# Aperçu des données
matching_players_teams_SKC.head(5)

   player_id  team_id
0      12445       78
1      33208       78
2      27685       70
3     179994       78
4      20199       78

In [11]:
# Supression des player_id dupliqués
matching_players_teams_SKC.drop_duplicates(subset = "player_id", inplace = True)

In [13]:
matching_players_teams_SKC

      player_id  team_id
0         12445       78
1         33208       78
2         27685       70
3        179994       78
4         20199       78
...         ...      ...
8231     823533       93
8316     662530       75
8318     809336       75
8333     663216       70
8357     826872      311

[493 rows x 2 columns]